app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function index(): string
    {
        $cliente = new ClientesModel();
        $datos['datos']=$cliente->findAll();

DELETE FROM `clientes`
WHERE `cliente_id` IN ('3')
---
    public function eliminarCliente($id=null){
        echo $id;
        $clientes = new ClientesModel();
        $clientes->delete(['cliente_id'=>$id]);

SELECT *
FROM `clientes`
WHERE `cliente_id` = '3'
 LIMIT 1
---
    public function buscarCliente($id=null){


        $clientes = new ClientesModel();
        $datos['datos']=$clientes->where('cliente_id', $id)->first();