app/Controllers/LineasTelefonicasController.php

    public function index(): string
    {
        $linea = new LineasTelefonicasModel();
        $datos['datos']=$linea->findAll();
---
SELECT *
FROM `lineas_telefonicas`

    public function eliminarLinea($id=null){
        echo $id;
        $lineas = new LineasTelefonicasModel();
        $lineas->delete(['no_telefono'=>$id]);
---
DELETE FROM `lineas_telefonicas`
WHERE `no_telefono` IN ('41406311')

    public function buscarLinea($id=null){
       // echo $id;
       $lineas = new LineasTelefonicasModel();
       $datos['datos']=$lineas->where('no_telefono', $id)->first();
---
SELECT *
FROM `lineas_telefonicas`
WHERE `no_telefono` = '41406311'
 LIMIT 1