app/Controllers/PlanesController.php

    public function index(): string
    {
        $plan = new PlanesModel();
        $datos['datos']=$plan->findAll();
---
SELECT *
FROM `planes`